<template>
  <div>
    <headTop></headTop>
    <div class="root">
      <div class="Card" style="padding-bottom: 50px">
        <div class="title">
          早
        </div>
        <div class="detail">
          三味书屋是三间的小花厅。还没进门，迎面先扑来一阵清香。
          那清香纯净疏淡，像是桂花香，又像是兰花香。
          细想又都不像，因为小寒前后，桂花早已开过，
          兰花却还要迟些日子才开。是什么香呢？
          据说“三味”是把书比作五谷、蔬菜、点心的，
          也许这就是书香？三味书屋是几十年前的书塾，
          当年“子曰”“诗云”，咿咿呀呀的读书声，街上都能听得到。
          三味书屋是三间的小花厅。还没进门，迎面先扑来一阵清香。
          那清香纯净疏淡，像是桂花香，又像是兰花香。
          细想又都不像，因为小寒前后，桂花早已开过，
          兰花却还要迟些日子才开。是什么香呢？
          据说“三味”是把书比作五谷、蔬菜、点心的，
          也许这就是书香？三味书屋是几十年前的书塾，
          当年“子曰”“诗云”，咿咿呀呀的读书声，街上都能听得到。
          三味书屋是三间的小花厅。还没进门，迎面先扑来一阵清香。
          那清香纯净疏淡，像是桂花香，又像是兰花香。
          细想又都不像，因为小寒前后，桂花早已开过，
          兰花却还要迟些日子才开。是什么香呢？
          据说“三味”是把书比作五谷、蔬菜、点心的，
          也许这就是书香？三味书屋是几十年前的书塾，
          当年“子曰”“诗云”，咿咿呀呀的读书声，街上都能听得到。
          三味书屋是三间的小花厅。还没进门，迎面先扑来一阵清香。
          那清香纯净疏淡，像是桂花香，又像是兰花香。
          细想又都不像，因为小寒前后，桂花早已开过，
          兰花却还要迟些日子才开。是什么香呢？
          据说“三味”是把书比作五谷、蔬菜、点心的，
          也许这就是书香？三味书屋是几十年前的书塾，
          当年“子曰”“诗云”，咿咿呀呀的读书声，街上都能听得到。三味书屋是三间的小花厅。还没进门，迎面先扑来一阵清香。
          那清香纯净疏淡，像是桂花香，又像是兰花香。
          细想又都不像，因为小寒前后，桂花早已开过，
          兰花却还要迟些日子才开。是什么香呢？
          据说“三味”是把书比作五谷、蔬菜、点心的，
          也许这就是书香？三味书屋是几十年前的书塾，
          当年“子曰”“诗云”，咿咿呀呀的读书声，街上都能听得到。三味书屋是三间的小花厅。还没进门，迎面先扑来一阵清香。
          那清香纯净疏淡，像是桂花香，又像是兰花香。
          细想又都不像，因为小寒前后，桂花早已开过，
          兰花却还要迟些日子才开。是什么香呢？
          据说“三味”是把书比作五谷、蔬菜、点心的，
          也许这就是书香？三味书屋是几十年前的书塾，
          当年“子曰”“诗云”，咿咿呀呀的读书声，街上都能听得到。三味书屋是三间的小花厅。还没进门，迎面先扑来一阵清香。
          那清香纯净疏淡，像是桂花香，又像是兰花香。
          细想又都不像，因为小寒前后，桂花早已开过，
          兰花却还要迟些日子才开。是什么香呢？
          据说“三味”是把书比作五谷、蔬菜、点心的，
          也许这就是书香？三味书屋是几十年前的书塾，
          当年“子曰”“诗云”，咿咿呀呀的读书声，街上都能听得到。三味书屋是三间的小花厅。还没进门，迎面先扑来一阵清香。
          那清香纯净疏淡，像是桂花香，又像是兰花香。
          细想又都不像，因为小寒前后，桂花早已开过，
          兰花却还要迟些日子才开。是什么香呢？
          据说“三味”是把书比作五谷、蔬菜、点心的，
          也许这就是书香？三味书屋是几十年前的书塾，
          当年“子曰”“诗云”，咿咿呀呀的读书声，街上都能听得到。三味书屋是三间的小花厅。还没进门，迎面先扑来一阵清香。
          那清香纯净疏淡，像是桂花香，又像是兰花香。
          细想又都不像，因为小寒前后，桂花早已开过，
          兰花却还要迟些日子才开。是什么香呢？
          据说“三味”是把书比作五谷、蔬菜、点心的，
          也许这就是书香？三味书屋是几十年前的书塾，
          当年“子曰”“诗云”，咿咿呀呀的读书声，街上都能听得到。三味书屋是三间的小花厅。还没进门，迎面先扑来一阵清香。
          那清香纯净疏淡，像是桂花香，又像是兰花香。
          细想又都不像，因为小寒前后，桂花早已开过，
          兰花却还要迟些日子才开。是什么香呢？
          据说“三味”是把书比作五谷、蔬菜、点心的，
          也许这就是书香？三味书屋是几十年前的书塾，
          当年“子曰”“诗云”，咿咿呀呀的读书声，街上都能听得到。三味书屋是三间的小花厅。还没进门，迎面先扑来一阵清香。
          那清香纯净疏淡，像是桂花香，又像是兰花香。
          细想又都不像，因为小寒前后，桂花早已开过，
          兰花却还要迟些日子才开。是什么香呢？
          据说“三味”是把书比作五谷、蔬菜、点心的，
          也许这就是书香？三味书屋是几十年前的书塾，
          当年“子曰”“诗云”，咿咿呀呀的读书声，街上都能听得到。
        </div>
      </div>
      <div class="comments">
        <div class="Card" style="margin-bottom: 50px">
          <div class="title2">
            评论区
          </div>
          <comment :comments="commentData"></comment>
        </div>
      </div>
    </div>

  </div>
</template>

<script>
  import HeadTop from '../components/HeadTop'
  import * as CommentData from '../data/mockdata'
  import comment from '../components/comment'

  export default {
    components: {
      'headTop': HeadTop,
      comment
    },
    data() {
      return {
        commentData: []
      }
    },
    created() {
      this.commentData = CommentData.comment.data;
    },
  }
</script>

<style scoped>
  @import './css/usual.css';

  .root {
    -webkit-box-align: center;
    -webkit-box-orient: vertical;
    height: auto;
    display: -webkit-box;
    display: -ms-flexbox;
    align-items: center;
    border-radius: 2px;
    box-sizing: border-box;
    min-height: calc(100vh - 40px);
    background-color: #E0E0E0;
  }
  .Card {
    width: 640px;
    height: auto;
    margin-top: 20px;
    padding: 30px 20px;
    padding-top: 20px !important;
  }
  .title {
    text-align: center;
    font-size: 24px;
    padding-bottom: 40px;
    font-weight: 600;
    border-bottom: 1px dashed #929292;
  }
  .detail {
    margin-top: 15px;
    font-size: 15px;
    color: #646464;
  }
  .title2{
    padding: 10px;
    color: #646464;
    font-size: 24px;
    text-align: center;
  }
</style>
